app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("datefrom", "dateto", "description_ukr", "description_ru", "description_en", "hourfrom", "hourto", "image", "location", "eventname_ua", "eventname_ru", "eventname_en", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)