app/controllers/newsletters_controller.rb

SELECT "newsletters".* FROM "newsletters"
---
  def index
    @newsletters = Newsletter.all

INSERT INTO "newsletters" ("email_address", "created_at", "updated_at") VALUES (?, ?, ?)  [["email_address", "tommy@mailinator.com"], ["created_at", "2018-05-01 15:21:49.229790"], ["updated_at", "2018-05-01 15:21:49.229790"]]
---
  def create
    @newsletter = Newsletter.new(newsletter_params)

    if @newsletter.save

DELETE FROM "newsletters" WHERE "newsletters"."id" = ?  [["id", 980190962]]
---
  def destroy
    @newsletter.destroy

SELECT  "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_newsletter
      @newsletter = Newsletter.find(params[:id])